Table of Contents
 Interface IIdeaCrossSectionByName
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A cross-section to import by name, any name is allowed. The correct cross-section is resolved by the user in CCM/Checkbot. Name must not be null.
public interface IIdeaCrossSectionByName : IIdeaCrossSection, IIdeaObject
Inherited Members
 IIdeaCrossSection.Rotation
 IIdeaCrossSection.IsInPrincipal
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Material
Material of the cross-section.
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Edit this page